#+TITLE:       Administrador de Sistemas GNU/Linux
#+AUTHOR:      Osiris Alejandro Gómez
#+EMAIL:       osiris@gcoop.coop
#+LANGUAGE:    es
#+LINK_HOME:   index.html
#+INCLUDE: "header.org"                                                 
#+DATE:        2014-01-20

*** =/proc/partitions=

    Podemos ver las particiones que leyó el /kernel/:

    #+BEGIN_SRC sh :session :results output :exports both
      cat /proc/partitions
    #+END_SRC

    #+RESULTS:
    : major minor  #blocks  name
    :
    :    8        0  488386584 sda
    :    8        1   52428800 sda1
    :    8        2   52428800 sda2
    :    8        3  383527960 sda3
    :   11        0    1048575 sr0
    :  254        0  383525912 dm-0

*** =/proc/uptime=

    El =uptime= de nuestro equipo puede ser consultado directamente en
    =/proc/uptime=,

    #+BEGIN_SRC sh :session :results output :exports both
      cat /proc/uptime
    #+END_SRC

    #+RESULTS:
    : 1901728.32 3010323.20

    Si utilizamos el comando =uptime=, éste lee el valor expresado en
    *epoc* (segundos que pasaron desde el 01/01/1970) y nos informa
    hace cuántos días y horas nuestro servidor está prendido, además
    de informar otros valores, como la cantidad de usuarios y el
    *average*:

    #+BEGIN_SRC sh :session :results output :exports both
      uptime
    #+END_SRC

    #+RESULTS:
    :  10:53:05 up 22 days, 15 min,  6 users,  load average: 1,63, 1,70, 1,58

*** =/dev/null=

    Este dispositivo es muy especial y sumamente útil, es un agujero
    negro, todo lo que se envía a =/dev/null= desaparece

    #+BEGIN_SRC sh :session :results output :exports both
      ls -lh /dev/null
    #+END_SRC

    #+RESULTS:
    : crw-rw-rw- 1 root root 1, 3 ene 20 10:37 /dev/null

    Si enviamos algo y luego miramos con un =ls= no vemos que se
    incremente el tamaño del archivo:

    #+BEGIN_SRC sh :session :results output :exports both
      echo "hola" >/dev/null
      ls -lh /dev/null
    #+END_SRC

    #+RESULTS:
    : crw-rw-rw- 1 root root 1, 3 ene 20 10:37 /dev/null

*** =/dev/sdX=

    Los discos están identificados con el prefijo =sd=, luego una letra
    =a=, =b=, =c=, etc y finalmente un número =1=, =2=, =3=, etc que
    identifica la partición:

    Listamos el disco =sda=

    #+BEGIN_SRC sh :session :results output :exports both
      ls /dev/sda*
    #+END_SRC

    #+RESULTS:
    : /dev/sda
    : /dev/sda1
    : /dev/sda2
    : /dev/sda3

    Vemos si esta montado =sda=:

    #+BEGIN_SRC sh :session :results output :exports both
      mount | grep sda
    #+END_SRC

    #+RESULTS:
    : /dev/sda1 on /mnt/sda1 type ext4 (rw,relatime,user_xattr,barrier=1,data=ordered)

    Visualizamos el espacio disponible:

    #+BEGIN_SRC sh :session :results output :exports both
      df -h | grep sda
    #+END_SRC

    #+RESULTS:
    : /dev/sda1                                                 50G    14G   34G  29% /mnt/sda1

** =stdout=

   Buscar el texto *model* en el archivo =/proc/cpuinfo= y enviar el
   resultado a un nuevo archivo llamado =/tmp/cpu= que contendrá
   únicamente las líneas que coinciden con el texto *model*:

   #+BEGIN_SRC sh :session :results output :exports both
     grep model /proc/cpuinfo > /tmp/cpu
     cat /tmp/cpu
   #+END_SRC

   #+RESULTS:
   : model		: 28
   : model name	: Intel(R) Atom(TM) CPU D425   @ 1.80GHz
   : model		: 28
   : model name	: Intel(R) Atom(TM) CPU D425   @ 1.80GHz

   Buscar el texto *cache* en el archivo =/proc/cpuinfo= y agregar el
   resultado al archivo =/tmp/cpu=

   #+BEGIN_SRC sh :session :results output :exports both
     grep cache /proc/cpuinfo >> /tmp/cpu
     cat /tmp/cpu
   #+END_SRC

   #+RESULTS:
   : model		: 28
   : model name	: Intel(R) Atom(TM) CPU D425   @ 1.80GHz
   : model		: 28
   : model name	: Intel(R) Atom(TM) CPU D425   @ 1.80GHz
   : cache size	: 512 KB
   : cache_alignment	: 64
   : cache size	: 512 KB
   : cache_alignment	: 64

** pipes

   El símbolo =|= es usado para redireccionar la salida de un comando
   a la entrada de otro comando.

   Ejemplo:

     Lista el directorio =/var/log= ordenando los archivos más nuevos
     al principio y muestra sólo las primeras 10 líneas mediante el
     comando =head=

     #+BEGIN_SRC sh :session :results output :exports both
       ls -lht /var/log | head
     #+END_SRC

     #+RESULTS:
     #+begin_example
     total 14M
     -rw-rw-r-- 1 root              utmp       107K feb 10 20:46 wtmp
     -rw-r----- 1 root              adm        769K feb 10 20:45 mail.info
     -rw-r----- 1 root              adm        769K feb 10 20:45 mail.log
     -rw-r----- 1 root              adm        356K feb 10 20:45 syslog
     -rw-r----- 1 root              adm        337K feb 10 20:45 auth.log
     -rw-r----- 1 root              adm        3,1K feb 10 19:49 messages
     -rw-r----- 1 root              adm        2,9K feb 10 19:49 kern.log
     -rw-r--r-- 1 root              root        29K feb 10 16:42 Xorg.0.log
     -rw-r----- 1 root              adm        1,9K feb 10 16:42 daemon.log
     #+end_example

     lista el directorio =/var/log= mostrando el tamaño de cada
     archivo, se filtra el resultando por Megabytes (=M=), luego
     ordena de mayor a menor y finalmente limita la lista a los
     primeros 10 archivos que más espacio ocupan, incluyendo el total
     del directorio:

     #+BEGIN_SRC sh :session :results output :exports both
       cd /var/log;du -ch *  | grep M | sort -nr | head
     #+END_SRC

     #+RESULTS:
     : 496M	total
     : 468M	atop
     : 15M	installer
     : 14M	installer/cdebconf
     : 3,3M	mail.log.1
     : 3,3M	mail.info.1
     : 1,5M	auth.log.1

*** =chmod 750 archivo=

    Listamos los permisos del archivo =~/.bash_history=

    #+BEGIN_SRC sh :session :results output :exports both
      ls -l ~/.bash_history
    #+END_SRC

    #+RESULTS:
    : -rwxr-x--- 1 osiris osiris 326316 feb 10 21:55 /home/osiris/.bash_history

    Cambiamos el permiso a =750= y volvemos a listar:

    #+BEGIN_SRC sh :session :results output :exports both
      chmod 750 ~/.bash_history
      ls -l ~/.bash_history
    #+END_SRC

    #+RESULTS:
    : -rwxr-x--- 1 osiris osiris 326316 feb 10 21:55 /home/osiris/.bash_history

    Finalmente cambiamos el permiso a =600= y volvemos a listar:

    #+BEGIN_SRC sh :session :results output :exports both
      chmod 600 ~/.bash_history
      ls -l ~/.bash_history
    #+END_SRC

    #+RESULTS:
    : -rw------- 1 osiris osiris 326316 feb 10 21:55 /home/osiris/.bash_history

** Moviendo, renombrando y copiando archivos:o

   Copiamos el archivo =~/.bash_history= a =~/.bash_history.bak= y
   verificamos que sea igual:

   #+BEGIN_SRC sh :session :results output :exports both
     ls -lh ~/.bash_history
     cp ~/.bash_history ~/.bash_history.bak
     ls -lh ~/.bash_history.bak
     md5sum ~/.bash_history ~/.bash_history.bak
   #+END_SRC

   #+RESULTS:
   : -rw------- 1 osiris osiris 310K feb 11 11:07 /home/osiris/.bash_history
   : -rw------- 1 osiris osiris 310K feb 11 11:07 /home/osiris/.bash_history
   : 7b862a967fc7096882583f9a6f662230  /home/osiris/.bash_history
   : 7b862a967fc7096882583f9a6f662230  /home/osiris/.bash_history.bak

   #+END_SRC

   Movemos el archivo =~/.bash_history.bak= a =~/historial.bak=:

   #+BEGIN_SRC sh :session :results output :exports both
     mv -vi ~/.bash_history.bak ~/historial.bak
     ls -l ~/.bash_history ~/historial.bak
   #+END_SRC

   #+RESULTS:
   : «/home/osiris/.bash_history.bak» -> «/home/osiris/historial.bak»
   : -rw------- 1 osiris osiris   316801 feb 11 11:07 /home/osiris/.bash_history
   : -rw------- 1 osiris www-data 316801 feb 11 11:13 /home/osiris/historial.bak


   Renombramos el archivo =~/historial.bak= a =~/historial.log=

   #+BEGIN_SRC sh :session :results output :exports both
     mv -vi ~/historial.bak ~/historial.log
     ls -l ~/historial.log
   #+END_SRC

   #+RESULTS:
   : «/home/osiris/historial.bak» -> «/home/osiris/historial.log»
   : -rw------- 1 osiris www-data 316801 feb 11 11:13 /home/osiris/historial.log

*** =cat=

    #+BEGIN_SRC sh :session :results output :exports both
      cat /etc/issue
    #+END_SRC

    #+RESULTS:
    : Debian GNU/Linux 7.0 \n \l
    :

*** =head=

    #+BEGIN_SRC sh :session :results output :exports both
      head /proc/meminfo | head
    #+END_SRC

    #+RESULTS:
    #+begin_example
    MemTotal:        2062464 kB
    MemFree:          872100 kB
    Buffers:           56052 kB
    Cached:           642468 kB
    SwapCached:        10928 kB
    Active:           520204 kB
    Inactive:         570096 kB
    Active(anon):     366124 kB
    Inactive(anon):   211844 kB
    Active(file):     154080 kB
    #+end_example

*** =head -2=
 
    #+BEGIN_SRC sh :session :results output :exports both
      head /proc/meminfo | head -2
    #+END_SRC

    #+RESULTS:
    : MemTotal:        2062464 kB
    : MemFree:          871860 kB

*** =tail=

    #+BEGIN_SRC sh :session :results output :exports both
      tail /etc/passwd
    #+END_SRC

    #+RESULTS:
    #+begin_example
    hplip:x:106:7:HPLIP system user,,,:/var/run/hplip:/bin/false
    pulse:x:107:114:PulseAudio daemon,,,:/var/run/pulse:/bin/false
    saned:x:108:118::/home/saned:/bin/false
    Debian-gdm:x:109:119:Gnome Display Manager:/var/lib/gdm3:/bin/false
    alumno:x:1001:1000:alumno,,,:/home/alumno:/bin/bash
    osiris:x:2222:33:OSiRiS,,,:/home/osiris:/bin/bash
    sshd:x:110:65534::/var/run/sshd:/usr/sbin/nologin
    postfix:x:111:120::/var/spool/postfix:/bin/false
    rodrigo:x:1002:1001:Rodrigo Fernandez,,,:/mnt/data/musica:/bin/bash
    davfs2:x:112:122::/var/cache/davfs2:/bin/false
    #+end_example

    #+BEGIN_SRC sh :session :results output :exports both
      tail -2 /etc/passwd
    #+END_SRC

    #+RESULTS:
    : rodrigo:x:1002:1001:Rodrigo Fernandez,,,:/mnt/data/musica:/bin/bash
    : davfs2:x:112:122::/var/cache/davfs2:/bin/false

*** =sed=

    #+BEGIN_SRC sh :session :results output :exports both
      cat /etc/issue
      sed s/"7.0"/"8.0"/g /etc/issue
      cat /etc/issue
    #+END_SRC

    #+RESULTS:
    : Debian GNU/Linux 7.0 \n \l
    :
    : Debian GNU/Linux 8.0 \n \l
    :
    : Debian GNU/Linux 7.0 \n \l
    :

***** disponibilidad horaria estimada

      |        |  lun | mar | mie | jue | vie |  tot |
      |--------+------+-----+-----+-----+-----+------|
      | diego  |  2.5 |   3 |   0 | 1.5 |   3 |  10. |
      | joac   |    3 |   3 |   0 | 1.5 |   3 | 10.5 |
      | jose   |    6 |   6 |   0 |   3 |   6 |   21 |
      | hugo   |    4 |   0 |   0 |   3 |   6 |   13 |
      | osiris |    3 |   3 |   0 |   3 |   6 |   15 |
      |--------+------+-----+-----+-----+-----+------|
      |        | 18.5 |  15 |   0 | 12. |  24 | 69.5 |
      #+TBLFM: $7=vsum($2..$6)::@>=vsum(@I..@II)

***** disponibilidad horaria real

      |        |  lun | mar | mie | jue | vie |  tot |
      |--------+------+-----+-----+-----+-----+------|
      | diego  |  2.5 |   3 |   0 | 1.5 |   3 |  10. |
      | joac   |    3 |   3 |   0 | 1.5 |   3 | 10.5 |
      | jose   |    6 |   6 |   0 |   3 |   6 |   21 |
      | hugo   |    4 |   0 |   0 |   3 |   6 |   13 |
      | osiris |    3 |   3 |   0 |   3 |   6 |   15 |
      |--------+------+-----+-----+-----+-----+------|
      |        | 18.5 |  15 |   0 | 12. |  24 | 69.5 |
      #+TBLFM: $7=vsum($2..$6)::@>=vsum(@I..@II)

***** estimado versus real

      #+tblname: scrum-2012-08-06
      |      fecha |  est | real | pend est | pend real |
      |------------+------+------+----------+-----------|
      | 2012-08-05 |    0 |    0 |    34.75 |     34.75 |
      | 2012-08-06 | 9.25 |    9 |     25.5 |     25.75 |
      | 2012-08-07 |  7.5 |  7.5 |      18. |     18.25 |
      | 2012-08-08 |    0 |    0 |      18. |     18.25 |
      | 2012-08-09 |    6 |    6 |      12. |     12.25 |
      | 2012-08-10 |   12 |    4 |       0. |      8.25 |
      |------------+------+------+----------+-----------|
      #+TBLFM: $4=@-1-$2::@2$4=vsum(@I$2..@II$2)-$2::@3$2=18.5/2::@3$5=@-1-$3::@4$2=15/2::@4$5=@-1-$3::@5$5=@-1-$3::@6$5=@-1-$3::@7$5=@-1-$3

